avr-rust/avrd/packs/atmega/ATmega644PA.atdf
        <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
          <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
          <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
          <bitfield caption="Data Order" mask="0x20" name="DORD"/>
          <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
          <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
          <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_SCK_RATE_3BIT">
        <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
        <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
        <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
        <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
        <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
        <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
        <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
        <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="PDIP40" caption="PDIP40">
      <pin position="1" pad="PB0"/>
      <pin position="2" pad="PB1"/>
      <pin position="3" pad="PB2"/>
      <pin position="4" pad="PB3"/>
      <pin position="5" pad="PB4"/>
      <pin position="6" pad="PB5"/>
      <pin position="7" pad="PB6"/>
      <pin position="8" pad="PB7"/>
      <pin position="9" pad="RESET"/>
      <pin position="10" pad="VCC"/>
      <pin position="11" pad="GND"/>
      <pin position="12" pad="XTAL2"/>
      <pin position="13" pad="XTAL1"/>
      <pin position="14" pad="PD0"/>
      <pin position="15" pad="PD1"/>
      <pin position="16" pad="PD2"/>
      <pin position="17" pad="PD3"/>
      <pin position="18" pad="PD4"/>
      <pin position="19" pad="PD5"/>
      <pin position="20" pad="PD6"/>
      <pin position="21" pad="PD7"/>
      <pin position="22" pad="PC0"/>
      <pin position="23" pad="PC1"/>
      <pin position="24" pad="PC2"/>
      <pin position="25" pad="PC3"/>
      <pin position="26" pad="PC4"/>
      <pin position="27" pad="PC5"/>
      <pin position="28" pad="PC6"/>
      <pin position="29" pad="PC7"/>
      <pin position="30" pad="AVCC"/>
      <pin position="31" pad="GND"/>
      <pin position="32" pad="AREF"/>
      <pin position="33" pad="PA7"/>
      <pin position="34" pad="PA6"/>
      <pin position="35" pad="PA5"/>
      <pin position="36" pad="PA4"/>
      <pin position="37" pad="PA3"/>
      <pin position="38" pad="PA2"/>
      <pin position="39" pad="PA1"/>
      <pin position="40" pad="PA0"/>
    </pinout>
    <pinout name="TQFP_QFN_44" caption="TQFP_QFN_44">
      <pin position="1" pad="PB5"/>
      <pin position="2" pad="PB6"/>
      <pin position="3" pad="PB7"/>
      <pin position="4" pad="RESET"/>
      <pin position="5" pad="VCC"/>
      <pin position="6" pad="GND"/>
      <pin position="7" pad="XTAL2"/>
      <pin position="8" pad="XTAL1"/>
      <pin position="9" pad="PD0"/>
      <pin position="10" pad="PD1"/>
      <pin position="11" pad="PD2"/>
      <pin position="12" pad="PD3"/>
      <pin position="13" pad="PD4"/>
      <pin position="14" pad="PD5"/>
      <pin position="15" pad="PD6"/>
      <pin position="16" pad="PD7"/>
      <pin position="17" pad="VCC"/>
      <pin position="18" pad="GND"/>
      <pin position="19" pad="PC0"/>
      <pin position="20" pad="PC1"/>
      <pin position="21" pad="PC2"/>
      <pin position="22" pad="PC3"/>
      <pin position="23" pad="PC4"/>
      <pin position="24" pad="PC5"/>
      <pin position="25" pad="PC6"/>
      <pin position="26" pad="PC7"/>
      <pin position="27" pad="AVCC"/>
      <pin position="28" pad="GND"/>
      <pin position="29" pad="REF"/>
      <pin position="30" pad="PA7"/>
      <pin position="31" pad="PA6"/>
      <pin position="32" pad="PA5"/>
      <pin position="33" pad="PA4"/>
      <pin position="34" pad="PA3"/>
      <pin position="35" pad="PA2"/>
      <pin position="36" pad="PA1"/>
      <pin position="37" pad="PA0"/>
      <pin position="38" pad="VCC"/>
      <pin position="39" pad="GND"/>
      <pin position="40" pad="PB0"/>
      <pin position="41" pad="PB1"/>
      <pin position="42" pad="PB2"/>
      <pin position="43" pad="PB3"/>
      <pin position="44" pad="PB4"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
